In [1]:
import pandas as pd
import numpy as np
from pathlib import Path
import plotly.express as mp

Change columns names with names option from read_csv function(Pandas library)

In [2]:
p_ = Path('/home/success/Downloads/Data_ML/data/numpy.csv')
population = pd.read_csv(p_, sep=';', names=['Villes', 'Pays', 'Code Postal', 'Population'])

In [3]:
population

        Villes     Pays Code Postal              Population
0         City  Country     Zipcode  Population in millions
1        Paris      NaN         NaN                   2 161
2       London      NaN         NaN                   8 982
3       Nevada      NaN         NaN                   3 144
4    Marseille      NaN         NaN               0.861 635
5     New York      NaN         NaN                   8 468
6      Chicago      NaN         NaN                   2 697
7  Los angeles      NaN         NaN                   3 849

In [4]:
population  = population.drop([0], axis=0)

In [5]:
population

        Villes Pays Code Postal Population
1        Paris  NaN         NaN      2 161
2       London  NaN         NaN      8 982
3       Nevada  NaN         NaN      3 144
4    Marseille  NaN         NaN  0.861 635
5     New York  NaN         NaN      8 468
6      Chicago  NaN         NaN      2 697
7  Los angeles  NaN         NaN      3 849

In [6]:
values = {"Pays":'non précisé'}
population.fillna(value=values, inplace = True)
population

        Villes         Pays Code Postal Population
1        Paris  non précisé         NaN      2 161
2       London  non précisé         NaN      8 982
3       Nevada  non précisé         NaN      3 144
4    Marseille  non précisé         NaN  0.861 635
5     New York  non précisé         NaN      8 468
6      Chicago  non précisé         NaN      2 697
7  Los angeles  non précisé         NaN      3 849

Rename NaN Values in order to be more understanding for users

In [7]:
population.dropna(axis=1)

        Villes         Pays Population
1        Paris  non précisé      2 161
2       London  non précisé      8 982
3       Nevada  non précisé      3 144
4    Marseille  non précisé  0.861 635
5     New York  non précisé      8 468
6      Chicago  non précisé      2 697
7  Los angeles  non précisé      3 849

info array

In [8]:
print(population['Population'].shape)
print(population['Population'].ndim)
print(population['Population'].size)
print(population['Population'].dtype)

(7,)
1
7
object

In [9]:
population['Population']

1        2 161
2        8 982
3        3 144
4    0.861 635
5        8 468
6        2 697
7        3 849
Name: Population, dtype: object

In [10]:
population['Population']

1        2 161
2        8 982
3        3 144
4    0.861 635
5        8 468
6        2 697
7        3 849
Name: Population, dtype: object

Visualize data to have a global view and know how to clean them for treatment(next step)